tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "sanemat/font"
brew "git"
brew "git-extras"
brew "mise"
brew "mysql"
brew "tree"
brew "vim"
brew "wget"
cask "aws-vault"

brew "autoconf"
brew "cairo"
brew "carthage"
brew "clang-format"
brew "glib"
brew "wxwidgets"
brew "harfbuzz"
brew "pango"
brew "fontforge"
brew "fop"
brew "gobject-introspection"
brew "nghttp2"
brew "nkf"
brew "protobuf"
brew "unixodbc"
brew "sanemat/font/ricty"
cask "fig"
