tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "kayac/tap"
tap "sanemat/font"
tap "songmu/tap"
brew "awscli"
brew "bat"
brew "direnv"
brew "erlang"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "go"
brew "jq"
brew "mysql"
brew "node"
brew "ripgrep"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "yq"
brew "hashicorp/tap/terraform"
brew "kayac/tap/ecspresso"
brew "songmu/tap/ecschedule"
cask "aws-vault"

brew "anyenv"
brew "autoconf"
brew "cairo"
brew "carthage"
brew "clang-format"
brew "glib"
brew "wxwidgets"
brew "harfbuzz"
brew "pango"
brew "fontforge"
brew "fop"
brew "fzf"
brew "gobject-introspection"
brew "lua"
brew "protobuf"
brew "nghttp2"
brew "nkf"
brew "openjdk@11"
brew "pipenv"
brew "ruby"
brew "swiftlint"
brew "unixodbc"
brew "sanemat/font/ricty"
cask "fig"
